### Creating, Reading and Writing

In [105]:
# To use pandas

import pandas as pd

In [106]:
pd.DataFrame({'Yes': [50, 21], 'No': [131, 2]})

   Yes   No
0   50  131
1   21    2

- DataFrame is a table. It contains an array of individual entries, each of which has a certain value. Each entry corresponds to a row (or record) amd a column.

In [107]:
pd.DataFrame({'Yes': [50, 21], 'No': [131, 2]})

   Yes   No
0   50  131
1   21    2

In [108]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 'Sue':['Pretty good', 'Bland.']})

             Bob          Sue
0    I liked it.  Pretty good
1  It was awful.       Bland.

In [109]:
# The list of row labels used in a DataFrame is known as an index

pd.DataFrame({'Bob': ['I liked it.', 'It was awful'],
              'Sue': ['Pretty good', 'Bland']},
             index=['Product A', 'Product B'])

                    Bob          Sue
Product A   I liked it.  Pretty good
Product B  It was awful        Bland

- A Series is a sequence of data values. If a DataFrame is a table, a Series is a list.

In [110]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [111]:
# A Series is a single column of a DataFrame.

pd.Series([30, 35, 40], index = ['2015 Sales', '2016 Sales', '2017 Sales'], name='Product A')

2015 Sales    30
2016 Sales    35
2017 Sales    40
Name: Product A, dtype: int64

- CSV file is a table of values separated by commas. (Comma-Separated Values)

In [112]:
finance_reviews = pd.read_csv('C:/Users/pps/Desktop/배정환(인턴)/finance.csv', encoding='euc-kr')

In [113]:
# DataFrame has 100 records split across 3 different columns. 300 entries

finance_reviews.shape

(100, 3)

In [114]:
# DataFrame using the head() command, which grabs the first five rows:
# But right now we have 3 different columns

finance_reviews.head()

   나이  학력수준           소득
0  54    14  66814.19458
1  40    12  42144.33812
2  35    14  25697.76715
3  55    12  35976.87400
4  40    12  39060.60606

In [115]:
finance_reviews = pd.read_csv('C:/Users/pps/Desktop/배정환(인턴)/finance.csv', encoding='euc-kr', index_col=0)
finance_reviews.head()

    학력수준           소득
나이
54    14  66814.19458
40    12  42144.33812
35    14  25697.76715
55    12  35976.87400
40    12  39060.60606

### Indexing, Selecting & Assigning

In [116]:
# Showing the data max rows to 5, which is showing short.

pd.set_option('display.max_rows', 5)

In [117]:
finance_reviews

    학력수준           소득
나이
54    14  66814.19458
40    12  42144.33812
..   ...          ...
30    14  52423.44498
28    12  37004.78469

[100 rows x 2 columns]

In [118]:
# Access to property of an object by accessing it as an attribute.
finance_reviews.학력수준

나이
54    14
40    12
      ..
30    14
28    12
Name: 학력수준, Length: 100, dtype: int64

In [119]:
finance_reviews['학력수준']

나이
54    14
40    12
      ..
30    14
28    12
Name: 학력수준, Length: 100, dtype: int64

In [120]:
# Selecting a specific Series out of a DataFrame.
finance_reviews['학력수준'][54]

14

In [121]:
# Indexing in pandas
# Index-based selection : selecting data based on its numerical position in the data (iloc)
# To select the first row of data in a DataFrame
# I should've write finance_reviews.iloc[0] but the age starts with 54.

finance_reviews.iloc[54]

학력수준        12.0000
소득      169605.2632
Name: 50, dtype: float64

In [122]:
# Both loc and iloc are row-first, column-second. Which is different with python as column-first, row-second
# It means it is easy to retrieve rows, and hard to get retrieve columns
# To get a column with iloc

finance_reviews.iloc[:, 0]

나이
54    14
40    12
      ..
30    14
28    12
Name: 학력수준, Length: 100, dtype: int64

In [123]:
# : operator can be used to indicate a range of values

finance_reviews.iloc[:3,0]

나이
54    14
40    12
35    14
Name: 학력수준, dtype: int64

In [124]:
# Or, to select just the second and third entries

finance_reviews.iloc[1:3,0]

나이
40    12
35    14
Name: 학력수준, dtype: int64

In [125]:
# pass a list

finance_reviews.iloc[[0,1,2], 0]

나이
54    14
40    12
35    14
Name: 학력수준, dtype: int64

In [126]:
# Negative numbers can be used
# This will start counting forwards from the end of the values

finance_reviews.iloc[-5:]

    학력수준            소득
나이
25    14   4625.598086
50    17  50367.623600
67    14  66814.194580
30    14  52423.444980
28    12  37004.784690

In [127]:
# Label-based selection : data index value, not its position

finance_reviews.loc[54, '학력수준']

14.0

In [128]:
# loc : It allows to access rows and columns using their labels (indices and column names)
# When your dataset has meaningful indices (like dates, names, categories), using 'loc' makes operations more intuitive because you can directly use the labels.

finance_reviews.loc[:, ['학력수준', '소득']]

    학력수준           소득
나이
54    14  66814.19458
40    12  42144.33812
..   ...          ...
30    14  52423.44498
28    12  37004.78469

[100 rows x 2 columns]

In [129]:
# Manipulating the index
# set_index() :  manipulate the index

finance_reviews.set_index("소득")

             학력수준
소득
66814.19458    14
42144.33812    12
...           ...
52423.44498    14
37004.78469    12

[100 rows x 1 columns]

In [130]:
# Conditional selection

finance_reviews.학력수준 == 14

나이
54     True
40    False
      ...
30     True
28    False
Name: 학력수준, Length: 100, dtype: bool

In [131]:
# We can find that how many person's 학력 is 14
finance_reviews.loc[finance_reviews.학력수준 == 14]

    학력수준           소득
나이
54    14  66814.19458
35    14  25697.76715
..   ...          ...
67    14  66814.19458
30    14  52423.44498

[23 rows x 2 columns]

In [132]:
# Using & (ampersand) bring 2 questions together
# if the 학력수준 is 14 and 소득 is >= than 55000

finance_reviews.loc[(finance_reviews.학력수준 == 14) & (finance_reviews.소득 >= 55000)]

    학력수준            소득
나이
54    14   66814.19458
40    14   71953.74801
..   ...           ...
44    14  177828.54860
67    14   66814.19458

[7 rows x 2 columns]

In [133]:
# If the 학력수준 is 14 or 소득 is >= 55000

finance_reviews.loc[(finance_reviews.학력수준 == 14) | (finance_reviews.소득 >= 55000)]

    학력수준           소득
나이
54    14  66814.19458
35    14  25697.76715
..   ...          ...
67    14  66814.19458
30    14  52423.44498

[46 rows x 2 columns]

In [134]:
# Built-in conditional selectors
# isin : Select the data whose value "is in" a list of values

finance_reviews.loc[finance_reviews.학력수준.isin([14, 12])]

    학력수준           소득
나이
54    14  66814.19458
40    12  42144.33812
..   ...          ...
30    14  52423.44498
28    12  37004.78469

[53 rows x 2 columns]

#### Example of isnull() and notnull()

In [135]:
# isnull (companion with notnull) : Highlight values which are (or are not) empty (NaN)
# In pandas, they initialize the missing value with 'NaN', also 'None'
# isnull() : if the value is NaN, it is True if the value is not NaN, it is False
# notnull() : if the value is NaN, it is False if the value is not NaN, it is True (It is opposite with isnull())

# finance_reviews.loc[finance_reviews.학력수준.notnull()] # It is not collecting missing value

# import pandas as pd
# from pandas import DataFrame

# df_left = DataFrame({'KEY':['K0','K1','K2','K3'], 'A': ['A0','A1','A2','A3'], 'B': [0.5, 2.2, 3.6, 0.4]})
# df_right = DataFrame({'KEY': ['K2', 'K3', 'K4', 'K5'], 'C': ['C2', 'C3', 'C4', 'C5'], 'D': ['D2', 'D3', 'D4', 'D5']})

# df_all = pd.merge(df_left, df_right, how='outer', on='KEY')

# df_all

In [136]:
# df_all.loc[df_all.A.notnull()]

In [137]:
# Assigning data to DataFrame

finance_reviews['학력수준'] = 11
finance_reviews['학력수준']

나이
54    11
40    11
      ..
30    11
28    11
Name: 학력수준, Length: 100, dtype: int64

In [138]:
finance_reviews['소득'] = range(len(finance_reviews), 0 , -1)
finance_reviews['소득']

나이
54    100
40     99
     ...
30      2
28      1
Name: 소득, Length: 100, dtype: int64

### Summary Functions and Maps

In [139]:
finance_reviews

    학력수준   소득
나이
54    11  100
40    11   99
..   ...  ...
30    11    2
28    11    1

[100 rows x 2 columns]

In [140]:
# describe() : summary function
# It is for numerical data

finance_reviews.소득.describe()

count    100.00
mean      50.50
          ...
75%       75.25
max      100.00
Name: 소득, Length: 8, dtype: float64

In [141]:
# For string data
import pandas as pd

titanic_reviews = pd.read_csv('C:/Users/pps/Desktop/배정환(인턴)/titanic.csv')

titanic_reviews

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [142]:
# Summary for string data

titanic_reviews.sex.describe()

count      891
unique       2
top       male
freq       577
Name: sex, dtype: object

In [143]:
# Get some particular summary statistic about a column in a DataFrame or a Series

titanic_reviews.age.mean()

29.69911764705882

In [144]:
# To see the list of unique values

titanic_reviews.embark_town.unique()

array(['Southampton', 'Cherbourg', 'Queenstown', nan], dtype=object)

In [145]:
# To see a list of unique values and how often they occur in the dataset
# Use value_counts()

titanic_reviews.embark_town.value_counts()

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

In [146]:
# map : is a term that takes one set of values and "maps" them to another set of values
# There are 2 ways mapping methods
# 1. map()

titanic_reviews_mean = titanic_reviews.age.mean()
titanic_reviews.age.map(lambda p : p - titanic_reviews_mean)

# map() returns a new Series where all the values have been transformed

0     -7.699118
1      8.300882
         ...
889   -3.699118
890    2.300882
Name: age, Length: 891, dtype: float64

In [147]:
# 2. apply()
# If we want to transform a whole DataFrame by calling a custom method on each row

def remean_age(row):
    row.age = row.age - titanic_reviews_mean
    return row

titanic_reviews.apply(remean_age, axis = 'columns')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,-7.699118,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,8.300882,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
889,1,1,male,-3.699118,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,2.300882,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [148]:
# map() and apply() return new, transformed Series and DataFrames
# If we look at the first row of titanic_reviews, we can see that it still has its original values

titanic_reviews.head(1)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.25,S,Third,man,True,NaN,Southampton,no,False

In [149]:
# Faster way of remeaning our age column:
titanic_reviews_mean = titanic_reviews.age.mean()
titanic_reviews.age - titanic_reviews_mean

0     -7.699118
1      8.300882
         ...
889   -3.699118
890    2.300882
Name: age, Length: 891, dtype: float64

In [150]:
# Easy way of combining two information in the dataset

titanic_reviews.sex + " - " + titanic_reviews.who

0          male - man
1      female - woman
            ...
889        male - man
890        male - man
Length: 891, dtype: object

In [151]:
# Kaggle Excercise Q.5
# Question : I'm an economical wine buyer. Which wine is the "best bargain"? Create a variable bargain_wine with the title of the wine with the highest points-to-price ratio in the dataset.

# Answer
# reviews['points-to-price ratio'] = reviews['points'] / reviews['price']
# bargain_wine = reviews.loc[reviews['points-to-price ratio'].idxmax(),'title']

In [152]:
# Kaggle Excercise Q.6
# Question : There are only so many words you can use when describing a bottle of wine. Is a wine more likely to be "tropical" or "fruity"?
# Create a Series descriptor_counts counting how many times each of these two words appears in the description column in the dataset. 
# (For simplicity, let's ignore the capitalized versions of these words.)

# Answer
# count_tropical = reviews.description.map(lambda p: "tropical" in p).sum()
# count_fruity = reviews.description.map(lambda p: "fruity" in p).sum()

# descriptor_counts = pd.Series([count_tropical, count_fruity], index=['tropical','fruity'])

In [153]:
# Kaggle Excercise Q.7
# Question : We'd like to host these wine reviews on our website, but a rating system ranging from 80 to 100 points is too hard to understand - we'd like to translate them into simple star ratings. 
# A score of 95 or higher counts as 3 stars, a score of at least 85 but less than 95 is 2 stars. Any other score is 1 star.
# Also, the Canadian Vintners Association bought a lot of ads on the site, so any wines from Canada should automatically get 3 stars, regardless of points.
# Create a series star_ratings with the number of stars corresponding to each review in the dataset.

# Answer
# def assign_stars(row):
#     if row['country'] == 'Canada':
#         return 3
#     elif row['points'] >= 95:
#         return 3
#     elif row['points'] >= 85:
#         return 2
#     else:
#         return 1

# reviews['star_ratings'] = reviews.apply(assign_stars, axis=1)

# star_ratings = reviews['star_ratings']

### Grouping and Sorting

In [154]:
# groupby() : created a group of reviews which allotted the same point values to the given.
# Then for each of these groups, grabbed the particular column and counted how many times it appeared.
# value_counts() is just a shortcut to groupby() operation
# Groupby - 데이터를 그룹화하고 그룹화된 데이터에 대한 연산을 수행하는데 매우 유용한 기능

titanic_reviews.groupby('age').age.count()

age
0.42     1
0.67     1
        ..
74.00    1
80.00    1
Name: age, Length: 88, dtype: int64

In [155]:
titanic_reviews.groupby('age').pclass.min()

age
0.42     3
0.67     2
        ..
74.00    3
80.00    1
Name: pclass, Length: 88, dtype: int64

In [156]:
# Groupby() -> This DataFrmae is accessible to us directly using the apply() method, and we can manipulate the data in any way

titanic_reviews.groupby('embarked').apply(lambda df: df.embark_town.iloc[0])

C:\Users\pps\AppData\Local\Temp\ipykernel_21004\581789266.py:3: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  titanic_reviews.groupby('embarked').apply(lambda df: df.embark_town.iloc[0])

embarked
C      Cherbourg
Q     Queenstown
S    Southampton
dtype: object

In [157]:
# Can also group by more than one column

titanic_reviews.groupby(['embark_town','alive']).apply(lambda df: df.loc[df.age.idxmax()])

C:\Users\pps\AppData\Local\Temp\ipykernel_21004\184865423.py:3: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  titanic_reviews.groupby(['embark_town','alive']).apply(lambda df: df.loc[df.age.idxmax()])

                   survived  pclass     sex   age  sibsp  parch     fare  \
embark_town alive
Cherbourg   no            0       1    male  71.0      0      0  34.6542
            yes           1       1  female  60.0      1      0  75.2500
...                     ...     ...     ...   ...    ...    ...      ...
Southampton no            0       3    male  74.0      0      0   7.7750
            yes           1       1    male  80.0      0      0  30.0000

                  embarked  class    who  adult_male deck  embark_town alive  \
embark_town alive
Cherbourg   no           C  First    man        True    A    Cherbourg    no
            yes          C  First  woman       False    D    Cherbourg   yes
...                    ...    ...    ...         ...  ...          ...   ...
Southampton no           S  Third    man        True  NaN  Southampton    no
            yes          S  First    man        True    A  Southampton   yes

                   alone
embark_town alive
Cherbourg   no      True
            yes    False
...                  ...
Southampton no      True
            yes     True

[6 rows x 15 columns]

In [163]:
# Another groupby() method
# agg()
# which lets you run a bunch of different functions on your DantaFrame simultaneously

titanic_reviews.groupby(['who']).age.agg([len, min, max])

C:\Users\pps\AppData\Local\Temp\ipykernel_21004\2077259410.py:6: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  titanic_reviews.groupby(['who']).age.agg([len, min, max])
C:\Users\pps\AppData\Local\Temp\ipykernel_21004\2077259410.py:6: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  titanic_reviews.groupby(['who']).age.agg([len, min, max])

       len    min   max
who
child   83   0.42  15.0
man    537  16.00  80.0
woman  271  16.00  63.0

#### Multi-indexes

In [166]:
# A multi-index differs from a regular index in that it has multiple levels
# 데이터 프레임에 여러 level(단계)의 인덱스를 넣는 것을 말한다
# 높은 차원을 다루는 데 유용하다


embark_town_reviewed = titanic_reviews.groupby(['embark_town', 'who']).alive.agg([len])
embark_town_reviewed

                   len
embark_town who
Cherbourg   child   18
            man     90
...                ...
Southampton man    410
            woman  174

[9 rows x 1 columns]

In [167]:
mi = embark_town_reviewed.index
type(mi)

pandas.core.indexes.multi.MultiIndex

In [168]:
# reset_index() - converting back to a regular index

embark_town_reviewed.reset_index()

    embark_town    who  len
0     Cherbourg  child   18
1     Cherbourg    man   90
..          ...    ...  ...
7   Southampton    man  410
8   Southampton  woman  174

[9 rows x 3 columns]

#### Sorting

In [169]:
# Grouping returns data in index order, not in value order
# When outputting the result of a groupby, the order of the rows is dependent on the values in the index, not in data
# To get data in the order want it in we can sort it ourselves
# sort_values()

# sorted by len
embark_town_reviewed = embark_town_reviewed.reset_index()
embark_town_reviewed.sort_values(by='len')

    embark_town    who  len
3    Queenstown  child    5
0     Cherbourg  child   18
..          ...    ...  ...
8   Southampton  woman  174
7   Southampton    man  410

[9 rows x 3 columns]

In [170]:
# sort_values() defaults to an ascending sort, low -> high
# If you want descending sort:

embark_town_reviewed.sort_values(by='len', ascending=False)

    embark_town    who  len
7   Southampton    man  410
8   Southampton  woman  174
..          ...    ...  ...
0     Cherbourg  child   18
3    Queenstown  child    5

[9 rows x 3 columns]

In [171]:
# To sort by index values, use sort_index()
# same arguments and default order

embark_town_reviewed.sort_index()

    embark_town    who  len
0     Cherbourg  child   18
1     Cherbourg    man   90
..          ...    ...  ...
7   Southampton    man  410
8   Southampton  woman  174

[9 rows x 3 columns]

In [173]:
embark_town_reviewed.sort_values(by=['who','len'])

    embark_town    who  len
3    Queenstown  child    5
0     Cherbourg  child   18
..          ...    ...  ...
2     Cherbourg  woman   60
8   Southampton  woman  174

[9 rows x 3 columns]

### Data Types and Missing Values

In [174]:
# Data type for a column in a DataFrame or Series is known as dtype
# Use dtype property to grab the type of a specific column

titanic_reviews.age.dtype

dtype('float64')

In [175]:
# The dtype property returns the dtype of every column in the DataFrame

titanic_reviews.dtypes

survived     int64
pclass       int64
             ...
alive       object
alone         bool
Length: 15, dtype: object

In [178]:
# Data types tell how pandas is storing the data
# float64 means that it's using a 64-bit floating point number
# *** columns consisting entirely of strings do not get their own type
# they are given the object type
# It's possible to convert a column of one type into another by using the astype()

titanic_reviews.age.astype('float64')

0      22.0
1      38.0
       ...
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [179]:
# DataFrame or Series index has its own dtype

titanic_reviews.index.dtype

# Pandas also supports more exotic data types such as categorical data and timeseries data

dtype('int64')

#### Missing Data

In [187]:
# Entries missing values are given the value NaN
# NaN values are always of the float64 type

titanic_reviews[pd.isnull(titanic_reviews.embark_town)]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
61,1,1,female,38.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True
829,1,1,female,62.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True

In [190]:
# Replacing missing values
# fillna()
# Provides a few different strategies for mitigating such data

titanic_reviews.deck.fillna("Unknown")

0      Unknown
1            C
        ...
889          C
890    Unknown
Name: deck, Length: 891, dtype: object

In [194]:
# Backfill strategy
# Fill each missing value with the first non-null value that appears sometime after the given record in the database

titanic_reviews.deck.replace("C","HELLO")

0        NaN
1      HELLO
       ...
889    HELLO
890      NaN
Name: deck, Length: 891, dtype: object